In [17]:
import pandas as pd

In [3]:
data = [1, 2, 3, 4, 5]

In [5]:
data

[1, 2, 3, 4, 5]

In [23]:
index = ['a', 'b', 'c', 'd', 'e']

In [25]:
series1 = pd.Series(data, index=index, name='My Series')

In [27]:
series1

a    1
b    2
c    3
d    4
e    5
Name: My Series, dtype: int64

In [31]:
sum(series1)

15

In [37]:
series1.mean()

3.0

In [39]:
min(series1)

1

In [41]:
max(series1)

5

In [47]:
series1.isnull()

a    False
b    False
c    False
d    False
e    False
Name: My Series, dtype: bool

In [49]:
series1.notnull()

a    True
b    True
c    True
d    True
e    True
Name: My Series, dtype: bool

In [55]:
import numpy as np
data = {
    'Column1': [1, np.nan, 3, 4],
    'Column2': ['A', 'B', np.nan, 'D']
}

In [57]:
data

{'Column1': [1, nan, 3, 4], 'Column2': ['A', 'B', nan, 'D']}

In [59]:
df = pd.DataFrame(data)

In [61]:
df

   Column1 Column2
0      1.0       A
1      NaN       B
2      3.0     NaN
3      4.0       D

In [63]:
df_dropped = df.dropna(axis=1)

In [65]:
df_dropped

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [67]:
df['New Column'] = np.nan

In [69]:
df

   Column1 Column2  New Column
0      1.0       A         NaN
1      NaN       B         NaN
2      3.0     NaN         NaN
3      4.0       D         NaN

In [71]:
df_filled = df.fillna(method='ffill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_18268\1548777210.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled = df.fillna(method='ffill')

In [73]:
df_filled

   Column1 Column2  New Column
0      1.0       A         NaN
1      1.0       B         NaN
2      3.0       B         NaN
3      4.0       D         NaN

In [75]:
df_filled = df.fillna(method='bfill')

C:\Users\Admin\AppData\Local\Temp\ipykernel_18268\3834817148.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled = df.fillna(method='bfill')

In [77]:
df_filled

   Column1 Column2  New Column
0      1.0       A         NaN
1      3.0       B         NaN
2      3.0       D         NaN
3      4.0       D         NaN